In [1]:
import pandas as pd

# Series

In [2]:
data = [1, 2, 3, 4, 5]

In [3]:
s = pd.Series(data)

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
index = ['Row_' + str(i) for i in range(5)]

In [6]:
index

['Row_0', 'Row_1', 'Row_2', 'Row_3', 'Row_4']

In [7]:
s = pd.Series(data = data, index = index)

In [8]:
s

Row_0    1
Row_1    2
Row_2    3
Row_3    4
Row_4    5
dtype: int64

In [9]:
data = {'Row_' + str(i) : i + 1 for i in range(5)}

In [10]:
data

{'Row_0': 1, 'Row_1': 2, 'Row_2': 3, 'Row_3': 4, 'Row_4': 5}

In [11]:
s = pd.Series(data)
s

Row_0    1
Row_1    2
Row_2    3
Row_3    4
Row_4    5
dtype: int64

In [12]:
s1 = s + 2
s1

Row_0    3
Row_1    4
Row_2    5
Row_3    6
Row_4    7
dtype: int64

In [13]:
s2 = s + s1
s2

Row_0     4
Row_1     6
Row_2     8
Row_3    10
Row_4    12
dtype: int64

# DataFrame

In [14]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

In [15]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [16]:
df1 = pd.DataFrame(data = data)

In [17]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [18]:
index = ['Row_' + str(i) for i in range(3)]

In [19]:
index

['Row_0', 'Row_1', 'Row_2']

In [20]:
df1 = pd.DataFrame(data = data, index = index)

In [21]:
df1

       0  1  2
Row_0  1  2  3
Row_1  4  5  6
Row_2  7  8  9

In [22]:
columns = ['Column_' + str(i) for i in range(3)]
columns

['Column_0', 'Column_1', 'Column_2']

In [23]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)

In [24]:
df1

       Column_0  Column_1  Column_2
Row_0         1         2         3
Row_1         4         5         6
Row_2         7         8         9

In [25]:
data = {'Column_0': {'Row_0': 1, 'Row_1': 4, 'Row_2': 7},
        'Column_1': {'Row_0': 2, 'Row_1': 5, 'Row_2': 8},
        'Column_2': {'Row_0': 3, 'Row_1': 6, 'Row_2': 9}}

In [26]:
data

{'Column_0': {'Row_0': 1, 'Row_1': 4, 'Row_2': 7},
 'Column_1': {'Row_0': 2, 'Row_1': 5, 'Row_2': 8},
 'Column_2': {'Row_0': 3, 'Row_1': 6, 'Row_2': 9}}

In [27]:
df2 = pd.DataFrame(data)

In [28]:
df2

       Column_0  Column_1  Column_2
Row_0         1         2         3
Row_1         4         5         6
Row_2         7         8         9

In [29]:
data = [(1, 2, 3),
        (4, 5, 6),
        (7, 8, 9)]

In [30]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [31]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

       Column_0  Column_1  Column_2
Row_0         1         2         3
Row_1         4         5         6
Row_2         7         8         9

In [32]:
df1[df1 > 0] = 'A'
df1

      Column_0 Column_1 Column_2
Row_0        A        A        A
Row_1        A        A        A
Row_2        A        A        A

In [33]:
df2[df2 > 0] = 'B'
df2

      Column_0 Column_1 Column_2
Row_0        B        B        B
Row_1        B        B        B
Row_2        B        B        B

In [34]:
df3[df3 > 0] = 'C'
df3

      Column_0 Column_1 Column_2
Row_0        C        C        C
Row_1        C        C        C
Row_2        C        C        C

In [35]:
df4 = pd.concat([df1, df2, df3])
df4

      Column_0 Column_1 Column_2
Row_0        A        A        A
Row_1        A        A        A
Row_2        A        A        A
Row_0        B        B        B
Row_1        B        B        B
Row_2        B        B        B
Row_0        C        C        C
Row_1        C        C        C
Row_2        C        C        C

In [36]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

,Column_0,Column_1,Column_2,Column_0,Column_1,Column_2,Column_0,Column_1,Column_2
Row_0,A,A,A,B,B,B,C,C,C
Row_1,A,A,A,B,B,B,C,C,C
Row_2,A,A,A,B,B,B,C,C,C

In [37]:
dados = [('A', 'B'), ('C', 'D')]
df = pd.DataFrame(dados, columns = ['L1', 'L2'],  index = ['C1', 'C2'])
df

   L1 L2
C1  A  B
C2  C  D

In [38]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [39]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4